IDEA StatiCa Open Model
ValueTypec Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Define type of c value
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum ValueTypec
Public Enumeration ValueTypec
public enum class ValueTypec
Members
Member name | Value | Description
UserDefined | 0 |  Value is inputed by user
ConstantCurvatureDistribution | 1 |  Value depends on constant curvature distributio
SinusoidalCurvatureDistribution | 2 |  Value depends on sinusoidal curvature distribution
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace